Repository: YagyeshGupta03/prime_coupons
Catalog: lib/l10n/intl_*.arb
Languages: es

source: Welcome to Prime Coupons - Amazon Coupons and Discounts
es: Prime Coupons - Cupones y Descuentos de Amazon

source: Latest Deals
es: Últimas ofertas

source: View all
es: Todas

source: Trending Deals
es: Tendencias

source: Top Categories
es: Más Solicitadas

source: Top Brands
es: Marcas Reconocidas

source: How to use Amazon coupon codes
es: Cómo utilizar descuentos de Amazon

source: Get A Prime Membership
es: Regístrese En AMAZON Prime

source: Visit CLIPEATE.COM
es: visitar CLIPEATE.COM

source: For Free Shipping
es: Para Envíos Gratis Y Aplicar Descuentos

source: Click Activate Coupon
es: Presione El Botón Activar Cupón

source: Confirm Your Discount
es: Confirma El Descuento

source: Proceed With Checkout
es: Realiza El Pago Checkout

source: Upcoming Deals
es: Próximas

# underTen
source: Under $ 10
es: Menos de $10

source: All Deals
es: Todas

source: Upcoming
es: Próximas

source: Valid until
es: Válida hasta

source: Activate Coupon
es: Activar cupón

source: This pictures of products are for reference only.
es: Imágenes de productos son solo para referencia

source: Please visit amazon for complete details
es: Visite Amazon para obtener detalles completos

source: Description And Pictures Of Product Are For Reference Only
es: Imágenes y Descripción de productos son solo para referencia

source: Sign in with Facebook
es: Ingresar con Facebook

source: Sign in with Google
es: Acceder con Google

source: Categories
es: Categorías

source: Home
es: Inicio

source: Under
es: Menos de

source: No products found
es: No hubo resultados

source: Category
es: Categoría

source: Favorites
es: Favoritos

source: Settings
es: Ajustes

source: Trending
es: Tendencias

source: Filter Results
es: Resultados de Filtrado

source: No results
es: No hubo resultados

source: Filter
es: Filtrar

source: Price
es: Precio

source: Status
es: Estatus

source: Instant Deals
es: Al instante

source: Discount
es: Descuentos

source: All Discounts
es: Todos los Descuentos

source: Off and above
es: Off y más

source: All Categories
es: Todas las Cat

source: All Category
es: Todas las Cat

source: Sorting
es: Clasificación

source: Default Rank
es: Rango Predeterminado

source: Price: Low To High
es: Precio: Bajo - Alto

source: Price: High To Low
es: Precio: Alto - Bajo

source: Discount: High To Low
es: Desc: Alto - Bajo

source: Newest
es: Recientes

source: Visit PrimeCoupons.com
es: visitar PrimeCoupons.com

source: About this item
es: Sobre este Producto

source: Related Products
es: Productos relacionados

source: Congrats!
es: En Hora Buena!

source: Coupon code activated
es: Cupón Activado

source: Will save you approx 50.74 on this purchase
es: Ahorrarás aprox. 50.74 en esta compra

source: Go direct to checkout
es: Ir directo a la caja checkout.

source: Code will be placed automatically
es: El código se colocará automáticamente

source: Coupon and available quantities are directly managed by amazon
es: Cupones y cantidades disponibles son manejados directamente por Amazon

# affiliateDisclosureAsAnAmazonAssociateWeMayEarnCommissions
source: Affiliate Disclosure: As an amazon associate, we may earn commissions from qualifying purchases from amazon.com
es: Divulgación de afiliados: como asociado de Amazon, podemos ganar comisiones de compras calificadas de amazon.com

source: Add To Favorites?
es: Colocar en Favoritos?

source: Sign in to Create Your Favorite List
es: Ingresa para crear tu lista de favoritos

source: Cancel
es: Cancelar

source: Search Results
es: Resultados de búsqueda

source: No search results
es: No hubo resultados

source: To create your favorite list
es: Para crear tu lista de favoritos

source: Sign in Here.
es: Ingresa aquí

source: My favorite products
es: Mi Lista de Favoritos

# couponsAndAvailableQuantitiesAreManagedDirectlyByAmazonUse
source: Coupons And Available Quantities Are Managed Directly By Amazon. Use Them As Soon As Possible.
es: Los Siguientes Cupones, Descuentos y Cantidades Disponibles son manejados directamente por Amazon. Utiliza Los Mismos Antes Que Expiren.

source: No Favorites Available
es: Tu lista está vacia

source: Do you want to delete this product from favorites?
es: Desea remover este producto de sus favoritos?

source: Delete
es: Remover

source: Select Language
es: Seleccione Idioma

source: Language
es: Idioma

source: Terms and conditions
es: Terminos y Condiciones

source: Privacy policy
es: Politica de Privacidad

source: Contact us
es: Soporte

source: Logout
es: Salir

source: Do you want to logout?
es: Deseas salir de tu cuenta?

source: Signed out successfully
es: Sesión terminada exitosamente

source: Check your internet connection
es: Verifica tu conexión

source: Refresh
es: Refrescar

source: A month ago
es: Hace un mes

source: Two months ago
es: Hace dos meses

source: Few months ago
es: Unos cuantos meses

source: Long time ago
es: Hace mucho tiempo

source: After a month
es: Luego de un mes

source: After two months
es: Luego de dos meses

source: After few months
es: Luego de varios meses

source: After long time
es: Luego de mucho tiempo

source: Total Coupons
es: Cupones Totales
